# GetOpenings Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
AnalyticalModelSurface..::..GetOpenings Method
AnalyticalModelSurface Class See Also
---
Retrieves Analytical Surface Openings Identifiers valid to be used in showOpening/hideOpening functions.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2013
# Syntax
C#
---
```text
public void GetOpenings(
	out ICollection<ElementId> openingsIds
)
```

Visual Basic
---
```text
Public Sub GetOpenings ( _
	<OutAttribute> ByRef openingsIds As ICollection(Of ElementId) _
)
```

Visual C++
---
```text
public:
void GetOpenings(
	[OutAttribute] ICollection<ElementId^>^% openingsIds
)
```

# ### Parameters
openingsIds
    Type: System.Collections.Generic..::..ICollection<(Of <(<'ElementId>)>)>% Set of openings Identifiers in Analytical Surface Element which are valid for hide.
# See Also
AnalyticalModelSurface Class
Autodesk.Revit.DB.Structure Namespace